// 지연님
//1. 위로 올라가는 버튼
// => y위치  몇 이상이면 보이도록 설정(style.visiblity 속성 이용)
// => 클릭하면 윈도우 스크롤 함수를 통해 위로 이동
// 8. 다크모드 라이트 모드를 변경해주는 함수


// 현철
// 2. input값의 유효성을 검사하는 함수
// => input의 값이 " "빈띄어쓰기거나 비속어 등등,


// 유진님
// 3. 영화 디테일 페이지 이동
// => 영화 카드 클릭 시 영화 디테일 페이지로 이동(window.location.href 또는 window.location.replace)
// => 영화 id를 확인해 해당하는 영화 제목,이미지, 줄거리와 아래 리뷰 작성칸이 있음 

// 지원님
// 4. 색션1(랜덤으로 랜더링하는 카드)를 생성해주는 함수
// => 영화리스트중 랜덤한 1개의 데이터를 가져와서
// 색션1의 스타일이 적용된 클래스들을 가진 html을 만들어 색션1에 어팬드 시켜주기


// 5. 리뷰 작성하는 함수
// => 닉네임?, 비밀번호,감상평을 필수로 입력해야 등록 가능 (input:required 속성)
// => 몇 자 미만이면 더 입력하라는 알림창 띄움.

// 6,7번 진우님
// 6. 로컬스토리지에 영화리스트를 저장하는 함수
// 7. 로컬스토리지에 클릭된카드의 id를 저장하는 함수
 
// => 닉네임, 비밀번호, 감상평 셋 다 로컬 스토리지에 저장